embedded-explorer/STM32-Driver-Development/Mastering MCU-1/Drivers/inc/stm32f401xx_usart.h
#ifndef INC_STM32F401XX_USART_H_
#define INC_STM32F401XX_USART_H_

#include "stm32f401xx.h"

// Configuration Structure for USARTx Peripherals
typedef struct
{
	uint8_t	 USART_Mode;			// @USART_Mode
	uint32_t  USART_Baud;			// @USART_Baud
	uint8_t	 USART_NoOfStopBits;	// @USART_NoOfStopBits
	uint8_t	 USART_WordLength;		// @USART_WordLength
	uint8_t	 USART_ParityControl;	// @USART_ParityControl
	uint8_t	 USART_HWFlowControl;	// @USART_HWFlowControl
}USART_Config_t;

// Handle Structure for USARTx Peripherals
typedef struct
{
	USART_RegDef_t *pUSARTx;
	USART_Config_t USART_Config;

	uint8_t		*pTxBuffer; // To Store Application Tx Buffer
	uint8_t		*pRxBuffer; // To Store Application Rx Buffer
	uint32_t	TxLen;		// To Store Tx Length
	uint32_t    RxLen;		// To Store Rx Length
	uint8_t		TxState;	// To Store Tx State
	uint8_t		RxState;	// To Store Rx State
}USART_Handle_t;

// USART_Mode
#define USART_MODE_ONLY_TX 				0
#define USART_MODE_ONLY_RX				1
#define USART_MODE_TXRX  				2

// USART_Baud
#define USART_STD_BAUD_1200					1200
#define USART_STD_BAUD_2400					2400
#define USART_STD_BAUD_9600					9600
#define USART_STD_BAUD_19200 				19200
#define USART_STD_BAUD_38400 				38400
#define USART_STD_BAUD_57600 				57600
#define USART_STD_BAUD_115200 				115200
#define USART_STD_BAUD_230400 				230400
#define USART_STD_BAUD_460800 				460800
#define USART_STD_BAUD_921600 				921600
#define USART_STD_BAUD_2M 					2000000
#define SUART_STD_BAUD_3M 					3000000

// USART_ParityControl
#define USART_PARITY_EN_ODD   2
#define USART_PARITY_EN_EVEN  1
#define USART_PARITY_DISABLE   0

// USART_WordLength
#define USART_WORDLEN_8BITS  0
#define USART_WORDLEN_9BITS  1

// USART_NoOfStopBits
#define USART_STOPBITS_1     0
#define USART_STOPBITS_0_5   1
#define USART_STOPBITS_2     2
#define USART_STOPBITS_1_5   3

// USART_HWFlowControl
#define USART_HW_FLOW_CTRL_NONE    	0
#define USART_HW_FLOW_CTRL_CTS    	1
#define USART_HW_FLOW_CTRL_RTS    	2
#define USART_HW_FLOW_CTRL_CTS_RTS	3

// USART Application States
#define USART_READY						0
#define USART_BUSY_IN_RX				1
#define USART_BUSY_IN_TX				2

// USART Application Event Macros
#define 	USART_EVENT_TX_CMPLT   	0
#define		USART_EVENT_RX_CMPLT   	1
#define		USART_EVENT_IDLE      	2
#define		USART_EVENT_CTS       	3
#define		USART_EVENT_PE        	4
#define		USART_ERR_FE     		5
#define		USART_ERR_NF    	 	6
#define		USART_ERR_ORE    		7

/******************************************************************************************
 *								APIs supported by this driver
 *		 For more information about the APIs check the function definitions
 ******************************************************************************************/

// Peripheral Clock setup
void USART_PeriClockControl(USART_RegDef_t *pUSARTx, uint8_t EnorDi);

// Initialization and Deinitialisation
void USART_Init(USART_Handle_t *pUSARTHandle);
void USART_DeInit(USART_RegDef_t *pUSARTx);

// Data Send and Receive
void USART_SendData(USART_Handle_t *pUSARTHandle,uint8_t *pTxBuffer, uint32_t Len);
void USART_ReceiveData(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len);
uint8_t USART_SendDataIT(USART_Handle_t *pUSARTHandle,uint8_t *pTxBuffer, uint32_t Len);
uint8_t USART_ReceiveDataIT(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len);

// IRQ Configuration and ISR handling
void USART_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi);
void USART_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority);
void USART_IRQHandling(USART_Handle_t *pHandle);

// Other Peripheral Control APIs
void USART_PeripheralControl(USART_RegDef_t *pUSARTx, uint8_t EnorDi);
uint8_t USART_GetFlagStatus(USART_RegDef_t *pUSARTx , uint32_t FlagName);
void USART_ClearFlag(USART_RegDef_t *pUSARTx, uint16_t StatusFlagName);

void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate);

// Application callback
void USART_ApplicationEventCallback(USART_Handle_t *pUSARTHandle,uint8_t AppEv);

#endif /* INC_STM32F401XX_USART_H_ */
